Catalogs/фин_ПричиныОтклоненийФактическихДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_ПричиныОтклоненийФактическихДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВлиянияНаФинансовыйРезультат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВидыВлиянияОтклонений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ВидыОтклоненийФактическихДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеОтклонение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтруктурногоОтклонения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВидыСтруктурныхОтклонений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/фин_ПричиныОтклоненийФактическихДанных/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если Не СтруктурноеОтклонение Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидСтруктурногоОтклонения");
	КонецЕсли;
		
	фин_ЗаполнениеДокументов.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка=Истина Тогда
		Возврат;
	КонецЕсли;
	Если ДополнительныеСвойства.Свойство("ВнешняяОбработка") Тогда
		Возврат;
	КонецЕсли;
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	Если Ссылка.СтруктурноеОтклонение = СтруктурноеОтклонение И Ссылка.ВидСтруктурногоОтклонения = ВидСтруктурногоОтклонения Тогда
		Возврат;
	КонецЕсли;
	РазрешеноИзменение = Справочники.фин_ПричиныОтклоненийФактическихДанных.РазрешеноИзменятьСтруктурныеХарактеристикиОтклонения(ЭтотОбъект);
	Если НЕ РазрешеноИзменение Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Элемент справочника Причины отклонений фактических данных """+Наименование+""" не записан, т.к. уже существуют документы рассмотрения отклонений.
		|	Невозможно изменение реквизитов ""Структурное отклонение"" и ""Вид структурного отклонения""");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецЕсли
